<template>
	<view>
		<cu-custom bgColor="bg-gradual-blue" :isBack="true">
			<block slot="backText">返回</block>
			<block slot="content">书摘</block>
		</cu-custom>
		<view class="Digest">
			<view class="">


				<ol>
					<li v-for="item in avatar" :key="item.avatar">{{item}}</li>
				</ol>
			</view>
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {

				avatar: [
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					'是的是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的是的所是的所 ',
					234,
					234,
				],

			};
		}
	}
</script>

<style scoped>
	.Digest {
		background-color: bisque;
		margin: 0;
		padding: 0;
		top: 90rpx;
		bottom: 0;
		left: 0;
		right: 0;
		position: fixed;
		/* 滚动条 */
		overflow-y: scroll;
	}

	li {

		margin: 30rpx 10rpx;
	}
</style>
